{
    "language": "Deutsch",
    "title": "Pascalsches Dreieck",
    "navbar_history": "Geschichte",
    "navbar_modelling": "Modellierung",
    "history_paragraph": "<br>Das Zahlenmuster, das Pascalsches Dreieck bildet, war lange vor Pascals Zeit bekannt. Der persische Mathematiker <em>Al-Karaji</em> (953-1029) schrieb ein jetzt verlorenes Buch, das die erste Formulierung der Binomialkoeffizienten und die erste Beschreibung von Pascalsches Dreieckk enthielt. Es wurde später von <em>Omar Khayyám</em> (1048-1131), einem weiteren persischen Mathematiker, wiederholt; daher wird das Dreieck in Iran auch als <i>Khayyáms Dreieck (مثلث خیام)</i> bezeichnet. Mehrere Sätze im Zusammenhang mit dem Dreieck waren bekannt, einschließlich des Binomischen Satzes. Khayyám verwendete eine Methode zur Bestimmung von n-ten Wurzeln, die auf der Binomialerweiterung und damit auf den Binomialkoeffizienten basierte.<br><br>Pascal's Dreieck war im frühen 11. Jahrhundert in China bekannt, durch die Arbeit des chinesischen Mathematikers <em>Jia Xian</em> (1010-1070). Im 13. Jahrhundert definierte <em>Yang Hui</em> (1238-1298) das Dreieck, und es ist in China als <i>Yang Huis Dreieck (杨辉三角; 楊輝三角)</i> bekannt.<br><br>In Europa tauchte Pascalsches Dreieck erstmals im <em>Arithmetica</em> von Jordanus de Nemore (13. Jahrhundert) auf. Die Binomialkoeffizienten wurden im frühen 14. Jahrhundert von <em>Gersonides</em> mit der multiplikativen Formel berechnet. <em>Petrus Apianus</em> (1495-1552) veröffentlichte das vollständige Dreieck auf dem Frontispiz seines Buches über Geschäftszahlen im Jahr 1527. <em>Michael Stifel</em> veröffentlichte 1544 einen Teil des Dreiecks (von der zweiten bis zur mittleren Spalte jeder Reihe) und beschrieb es als eine Tabelle der figurierten Zahlen. In Italien wird Pascalsches Dreieck als <i>Tartaglias Dreieck</i> bezeichnet, benannt nach dem italienischen Algebraisten <em>Tartaglia</em> (1500-1577), der 1556 sechs Reihen des Dreiecks veröffentlichte. <em>Gerolamo Cardano</em> veröffentlichte ebenfalls das Dreieck sowie die additiven und multiplikativen Regeln zu seiner Konstruktion im Jahr 1570.<br><br><em>Blaise Pascal</em>'s (1623-1662) <em>Traité du triangle arithmétique</em> (Abhandlung über das Arithmetische Dreieck) wurde 1665 posthum veröffentlicht. In diesem Werk sammelte Pascal mehrere damals bekannte Ergebnisse über das Dreieck und verwendete sie, um Probleme der Wahrscheinlichkeitsrechnung zu lösen. Später wurde das Dreieck nach Pascal von <em>Pierre Raymond de Montmort</em> (1708) als <em>table de M. Pascal pour les combinaisons</em> (Französisch: Herr Pascals Tabelle für Kombinationen) bezeichnet, und von <em>Abraham de Moivre</em> (1730) als <em>Triangulum Arithmeticum PASCALIANUM</em> (Latein: Pascals Arithmetisches Dreieck), was zur Grundlage des modernen westlichen Namens, <i>Pascalsches Dreieck</i>, wurde.<br><br><a class=\"source\" id=\"source\">Quelle: <a href=\"https://en.wikipedia.org/wiki/Pascal%27s_triangle#History\" target=\"_blank\" rel=\"noopener noreferrer\">https://en.wikipedia.org/wiki/Pascal%27s_triangle#History</a></a><br><br>"
}