{
    "language": "Русский",
    "title": "Треугольник Паскаля",
    "navbar_history": "История",
    "navbar_modelling": "Моделирование",
    "introduction_text": "Добро пожаловать на сайт Треугольника Паскаля!<p><br>Треугольник Паскаля — это не просто красивая картинка. Это мощный инструмент с приложениями от алгебры до теории вероятностей. Этот сайт — ваш гид по разгадке его тайн. Узнайте о его истории, экспериментируйте с интерактивными моделями и откройте для себя множество способов, как этот треугольник формирует наш мир.</p>",
    "history_text": "Исследуйте увлекательную историю треугольника Паскаля<p><br>От его древних корней в Китае, Персии и Индии до его формализации Блезом Паскалем в 17 веке, этот треугольник является ключевым математическим открытием на протяжении веков. Узнайте о математиках, внесших вклад в его развитие, и о том, как он повлиял на современную науку, от алгебры до теории вероятностей.<br><br></p><a href=\"history.html\">Узнать Больше</a>",
    "history_paragraph": "<br>Шаблон чисел, который формирует треугольник Паскаля, был известен задолго до времени Паскаля. Персидский математик <em>Аль-Караджи</em> (953–1029) написал утраченный ныне труд, в котором была представлена первая формулировка биномиальных коэффициентов и первое описание треугольника Паскаля. Позднее это было повторено другим персидским mathematicом <em>Омаром Хайямом</em> (1048–1131); поэтому этот треугольник также называют <i>треугольником Хайяма (مثلث خیام)</i> в Иране. Ряд теорем, связанных с этим треугольником, был известен, включая биномиальную теорему. Хайям использовал метод нахождения корней n-ой степени, основанный на биномиальном разложении и, следовательно, на биномиальных коэффициентах.<br><br>Треугольник Паскаля был известен в Китае в начале XI века благодаря работам китайского математика <em>Цзя Сянь</em> (1010–1070). В XIII веке <em>Ян Хуй</em> (1238–1298) определил этот треугольник, и в Китае он известен как <i>треугольник Ян Хуя (杨辉三角; 楊輝三角)</i>.<br><br>В Европе треугольник Паскаля впервые появился в <em>Арифметике Джордана де Немор</em> (XIII век). Биномиальные коэффициенты вычислял <em>Герсон</em> в начале XIV века, используя их мультипликативную формулу. <em>Петрус Апиан</em> (1495–1552) опубликовал полный треугольник на титульном листе своей книги о бизнес-вычислениях в 1527 году. <em>Михаил Штифель</em> опубликовал часть треугольника (с второго по средний столбец в каждой строке) в 1544 году, описав его как таблицу фигурных чисел. В Италии треугольник Паскаля называют <i>треугольником Тартальи</i>, в честь итальянского алгебраиста <em>Тартальи</em> (1500–1577), который опубликовал шесть строк треугольника в 1556 году. <em>Джероламо Кардано</em> также опубликовал треугольник и правила сложения и умножения для его построения в 1570 году.<br><br>Труд <em>Блеза Паскаля</em> (1623–1662) <em>Traité du triangle arithmétique</em> (Трактат о арифметическом треугольнике), был опубликован посмертно в 1665 году. В этом труде Паскаль собрал несколько известных на тот момент результатов о треугольнике и использовал их для решения задач теории вероятностей. Позже треугольник был назван в честь Паскаля <em>Пьером Рэймоном де Монтмором</em> (1708), который назвал его <em>table de M. Pascal pour les combinaisons</em> (фр. таблица М. Паскаля для комбинаций) и <em>Абрахамом де Мувром</em> (1730), который назвал его <em>Triangulum Arithmeticum PASCALIANUM</em> (лат. арифметический треугольник Паскаля), что стало основой для современного западного названия <i>треугольник Паскаля</i>.<br><br><a class=\"source\">Источник: <a href=\"https://en.wikipedia.org/wiki/Pascal%27s_triangle#History\" target=\"_blank\" rel=\"noopener noreferrer\">https://en.wikipedia.org/wiki/Pascal%27s_triangle#History</a></a><br><br>"
}