{
    "language": "Türkçe",
    "title": "Pascal Üçgeni",
    "navbar_history": "Tarihçe",
    "navbar_modelling": "Modelleme",
    "navbar_quiz": "Quiz",
    "introduction_text": "Pascal Üçgeni internet sitesine hoş geldiniz!<p><br>Pascal Üçgeni sadece hoş bir geometrik şekil olmanın ötesindedir. Cebirden olasılık teorisine kadar birçok alanda güçlü bir araçtır. Bu site, onun sırlarını keşfetmenize rehberlik edecektir. Tarihini öğrenin, etkileşimli modellerle deneyler yapın ve bu üçgenin dünyamızı şekillendiren birçok yönünü keşfedin.</p>",
    "history_text": "Pascal Üçgeni'nin büyüleyici tarihini keşfedin...<p><br>Çin, İran ve Hindistan'daki eski kökenlerinden 17. yüzyılda Blaise Pascal tarafından biçimlendirilmesine kadar, bu üçgen yüzyılları kapsayan önemli bir matematiksel keşif olmuştur. Gelişimine katkıda bulunan matematikçiler hakkında bilgi edinin ve cebirden olasılık teorisine kadar nasıl modern bilimi etkilediğini öğrenin.<br><br></p><a href=\"history.html\">Daha fazla bilgi edin</a>",
    "modelling_text": "Pascal Üçgeni Etkileşimli Modeli<p><br>Pascal Üçgeni'ni etkileşimli bir modelle keşfedin. Üçgenin satırlarında gezinin ve bu zamansız matematiksel yapının içinde saklı desenleri, katsayıları ve matematiksel ilişkileri keşfedin. İster binom açılımları, ister olasılık, isterse kombinatorik konularını çalışıyor olun, bu araç Pascal Üçgeni'ni görselleştirmenize ve anlamanıza yardımcı olacaktır.<br><br></p><a href=\"modelling.html\">Hemen Deneyin</a>",
    "quiz_text": "Bilginizi Test Edin!<p><br>Pascal Üçgeni hakkında her şeyi bildiğinizi mi düşünüyorsunuz? Bilginizi eğlenceli ve etkileşimli bir quizle test edin! İster bu matematiksel harikayı keşfetmeye yeni başlamış olun, ister deneyimli bir uzman olun, herkes için bir şeyler var.<br><br></p><a href=\"quiz.html\">Başla</a>",
    "history_1": "<p>Pascal üçgenini oluşturan sayıların deseni, Pascal'ın zamanından çok önce biliniyordu. Pers matematikçisi <em>Al-Karaji</em> (953-1029), binom katsayılarının ilk formülasyonunu ve Pascal üçgeninin ilk tanımını içeren, şimdi kaybolmuş bir kitap yazmıştır. Bu daha sonra başka bir Pers matematikçisi olan <em>Ömer Hayyam</em> (1048-1131) tarafından tekrar edilmiştir; bu yüzden üçgen, İran'da <i>Hayyam'ın üçgeni (مثلث خیام)</i> olarak da anılmaktadır. Üçgenle ilgili birkaç teorem bilinmekteydi, bunlar arasında binom teoremi de yer alıyordu. Ömer Hayyam, binom genişlemesi ve dolayısıyla binom katsayıları üzerine kurulu bir yöntem kullanarak n. dereceden kökleri bulma yöntemini geliştirmiştir.</p>",
    "history_2": "<p>Pascal üçgeni, Çinli matematikçi <em>Jia Xian</em> (1010-1070) tarafından 11. yüzyılın başlarında biliniyordu. 13. yüzyılda <em>Yang Hui</em> (1238-1298) üçgeni tanımlamıştır ve bu üçgen, Çin'de <i>Yang Hui'nin üçgeni (杨辉三角; 楊輝三角)</i> olarak bilinir.</p>",
    "history_3": "<p>Avrupa'da, Pascal üçgeni ilk kez 13. yüzyılda <em>Jordanus de Nemore</em>'nin <em>Aritmetik</em> adlı eserinde ortaya çıkmıştır. Binom katsayıları, 14. yüzyılın başlarında <em>Gersonides</em> tarafından çarpanlı formüllerle hesaplanmıştır. <em>Petrus Apianus</em> (1495-1552), 1527'de iş hesaplamaları üzerine yazdığı kitabının ön kapağında tam üçgeni yayımlamıştır. <em>Michael Stifel</em> (1544) üçgenin bir kısmını (her satırdaki ikinci ile orta sütun arasını) yayınlamış ve bunu figürlü sayılar tablosu olarak tanımlamıştır. İtalya'da, Pascal üçgenine <i>Tartaglia'nın üçgeni</i> denir; bu ad, 1556'da üçgenin altı satırını yayımlayan İtalyan cebirci <em>Tartaglia</em> (1500-1577)'dan gelmektedir. <em>Gerolamo Cardano</em> da üçgeni yayımlamış ve onu inşa etmek için kullanılan toplama ve çarpma kurallarını 1570'te tanımlamıştır.</p>",
    "history_4": "<p><em>Blaise Pascal</em>'ın (1623-1662) <em>Traité du triangle arithmétique</em> (Aritmetik Üçgen Üzerine Risale) eseri, 1665 yılında ölümünden sonra yayımlanmıştır. Bu eserde Pascal, o zamanlar üçgenle ilgili bilinen birkaç sonucu toplamış ve bunları olasılık teorisi problemlerini çözmek için kullanmıştır. Daha sonra üçgen, <em>Pierre Raymond de Montmort</em> (1708) tarafından <em>table de M. Pascal pour les combinaisons</em> (Fransızca: Bay Pascal'ın kombinasyonlar tablosu) olarak adlandırılmış, <em>Abraham de Moivre</em> (1730) ise ona <em>Triangulum Arithmeticum PASCALIANUM</em> (Latince: Pascal'ın Aritmetik Üçgeni) adını vermiştir. Bu, modern Batı adlandırmasının temeli olmuş ve <i>Pascal üçgeni</i> olarak bilinir olmuştur.</p>",
    "reference_text": "<a>Kaynakça: <a href=\"https://en.wikipedia.org/wiki/Pascal%27s_triangle#History\" target=\"_blank\" rel=\"noopener noreferrer\">https://en.wikipedia.org/wiki/Pascal%27s_triangle#History</a></a>",
    "guide": "<br><i>C</i> tuşuna basarak sayı görüntüleme modunu değiştirebilirsiniz<br><i>+</i> veya <i>W</i> tuşuna basarak satır sayısını artırabilirsiniz<br><i>-</i> veya <i>S</i> tuşuna basarak satır sayısını azaltabilirsiniz<br>Satırlara tıklayarak öğelerin toplamını görüntüleyebilirsiniz",
    "coming_soon": "Yakında: Daha Fazla Özellik ve Güncellemeler!<p><br>Deneyiminizi geliştirmek ve zenginleştirmek için sürekli olarak çalışıyoruz. Şu an birçok etkileşimli araç ve kaynağın tadını çıkarırken, heyecan verici yenilikler de geliştirme aşamasında. Bunlardan bazıları:<br><br>Yeni Görselleştirmeler – Etkileşimli bir Pascal Üçgeni modelini daha dinamik yollarla keşfedin.<br>Gelişmiş Hesaplayıcılar – Matematiksel kavramlara daha derinlemesine dalmanıza yardımcı olacak daha güçlü araçlar.<br>Kullanıcı Odaklı Özellikler – Sizi dinliyoruz! Geri bildiriminize dayalı olarak gelecek özellikler.<br>Detaylı Kılavuzlar ve Testler – Öğrenme yolculuğunuzu daha da geliştirecek yeni eğitimler ve testler.<br><br>Yakında daha fazlası gelecek, takipte kalın!",

    "quiz_title": "Pascal Üçgeni Testi",
    "quiz_submit_button": "Testi Gönder",
    "quiz_results_heading": "Sonuçlarınız",
    
    "question-1": "Pascal Üçgenini ilk tanımlayan İranlı matematikçi kimdir?",
    "answer-1-1": "Al-Karaji",
    "answer-1-2": "Ömer Hayyam",
    "answer-1-3": "Jia Xian",
    
    "question-2": "Pascal Üçgeni hangi yüzyılda Avrupa'da tanındı?",
    "answer-2-1": "11. yüzyıl",
    "answer-2-2": "13. yüzyıl",
    "answer-2-3": "17. yüzyıl",
    
    "question-3": "Blaise Pascal’ın Pascal Üçgeni üzerine yazdığı eserin adı nedir?",
    "answer-3-1": "Triangulum Arithmeticum",
    "answer-3-2": "Traité du triangle arithmétique",
    "answer-3-3": "Jordanus de Nemore'nin Aritmetiği",
    
    "question-4": "Pascal Üçgeni Çin’de ne olarak adlandırılır?",
    "answer-4-1": "Yang Hui'nin Üçgeni",
    "answer-4-2": "Tartaglia'nın Üçgeni",
    "answer-4-3": "Hayyam'ın Üçgeni",
    
    "question-5": "1527 yılında kitabının kapağında Pascal Üçgeni’ni kim yayınladı?",
    "answer-5-1": "Petrus Apianus",
    "answer-5-2": "Michael Stifel",
    "answer-5-3": "Gerolamo Cardano",
    
    "question-6": "Pascal Üçgeninin 4. satırındaki sayıların toplamı nedir?",
    "answer-6-1": "8",
    "answer-6-2": "16",
    "answer-6-3": "32",
    
    "question-7": "Pascal Üçgeninin hangi diyagonali Fibonacci dizisini içerir?",
    "answer-7-1": "2. diyagonal",
    "answer-7-2": "3. diyagonal",
    "answer-7-3": "4. diyagonal",
    
    "question-8": "Pascal Üçgenindeki her satır neyi temsil eder?",
    "answer-8-1": "Binom katsayıları",
    "answer-8-2": "Kare sayılar",
    "answer-8-3": "Küp katsayıları",
    
    "question-9": "Pascal Üçgeninin 5. satırında kaç sayı vardır?",
    "answer-9-1": "4",
    "answer-9-2": "5",
    "answer-9-3": "6",
    
    "question-10": "Pascal Üçgeninde iki bitişik sayı arasındaki ilişki nedir?",
    "answer-10-1": "Toplamları alt satırdaki sayıyı verir",
    "answer-10-2": "Birbirini takip eden sayılardır",
    "answer-10-3": "Birbirinin katıdır"
}